УТ_для_edt/src/Enums/ТипыТекстовЭлектронныхПисем/ТипыТекстовЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТекстовЭлектронныхПисем</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>ПростойТекст</name>
  </enumValues>
  <enumValues>
    <name>РазмеченныйТекст</name>
  </enumValues>
  <enumValues>
    <name>HTMLСКартинками</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/ЭлектронноеПисьмоИсходящее/ЭлектронноеПисьмоИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмоИсходящее</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <basedOn>Document.КоммерческоеПредложениеКлиенту</basedOn>
  <basedOn>Document.CRM_Интерес</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>CRM_АдресХранилищаФайлов</name>
    <comment>Служебный реквизит, используется для механизма шаблонов</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИзHTMLФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Предмет</name>
    <type>
      <types>DefinedType.ПредметВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РедактироватьТекстИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьИзСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТекстИзРассылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТипОтвета</name>
    <type>
      <types>EnumRef.CRM_ТипыОтвета</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщенияОтправкаIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыОснований</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <comment>Текстовое описание отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейСкрытыхКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПисьма</name>
    <type>
      <types>EnumRef.СтатусыИсходящегоЭлектронногоПисьма</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.РассылкаКлиентам</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>CatalogRef.ВидыОповещенийКлиентам</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПослеОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Папка</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКогдаОтправить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальностиОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторСообщенияОтправкаIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтправительАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтправительКонтакт</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НепринятыеВложения</name>
    <attributes>
      <name>ИмяВложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПисьмаВложения</name>
    <attributes>
      <name>Письмо</name>
      <type>
        <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
        <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерВоВложениях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.КоммерческоеПредложениеКлиенту</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПечатнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/CommonModules/CRM_ЛентаСобытийКлиент/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьВложение(Форма, ОповещениеЗавершения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("УникальныйИдентификатор", Форма.УникальныйИдентификатор);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	
	ОповещениеПродолжения = Новый ОписаниеОповещения(
		"ДобавитьВложениеПродолжить", CRM_ЛентаСобытийКлиент, ДополнительныеПараметры);
	
	ОбщегоНазначенияКлиент.ПроверитьРасширениеРаботыСФайламиПодключено(
		ОповещениеПродолжения,
		НСтр("ru='Для продолжения необходимо установить расширение для работы с файлами.'"));
	
КонецПроцедуры

Процедура ДобавитьВложениеПродолжить(ПодключеноРасширениеРаботыСФайлами, ДополнительныеПараметры) Экспорт
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Истина;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения(
		"ДобавитьВложениеЗавершение", CRM_ЛентаСобытийКлиент, ДополнительныеПараметры);
	
	НачатьПомещениеФайлов(ОповещениеЗавершения,, Диалог, Ложь, ДополнительныеПараметры.УникальныйИдентификатор);
	
КонецПроцедуры

Процедура ДобавитьВложениеЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Для Каждого ДанныеФайла Из ПомещенныеФайлы Цикл
		
		ИмяФайла = ДанныеФайла.Имя;
		ПозицияТочки = СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца);
		РасширениеФайла = ?(ПозицияТочки = 0, "", Прав(ИмяФайла, СтрДлина(ИмяФайла) - ПозицияТочки));
		
		МассивИменФайловСОшибками = Новый Массив;
		Если НЕ CRM_ЛентаСобытий.ПроверитьВозможностьЗагрузкиВложения(ИмяФайла, CRM_ЛентаСобытий.РазмерФайла(ДанныеФайла.Хранение), РасширениеФайла, Ложь, МассивИменФайловСОшибками) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Сообщение.Текст + МассивИменФайловСОшибками[0].Ошибка;
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока					= Форма.БыстрыйВвод_Вложения.Добавить();
		НоваяСтрока.ИмяФайла		= ИмяФайла;
		НоваяСтрока.АдресВХранилище	= ДанныеФайла.Хранение;
		НоваяСтрока.ИндексКартинки	= РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(РасширениеФайла);
		
	КонецЦикла;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗавершения, Истина);
	
КонецПроцедуры

Процедура УдалитьВложение(Форма, ИдентификаторВложения) Экспорт
	
	ТекущиеДанные = Форма.БыстрыйВвод_Вложения.НайтиПоИдентификатору(ИдентификаторВложения);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.БыстрыйВвод_Вложения.Удалить(ТекущиеДанные);
	
КонецПроцедуры

Функция ИменаКомандОбъектовЛенты() Экспорт
	
	ИменаКоманд = Новый Массив;
	
	ИменаКоманд.Добавить("ВзаимодействиеПланов_Открыть_");
	ИменаКоманд.Добавить("ВзаимодействиеПланов_Отменить");
	ИменаКоманд.Добавить("ВзаимодействиеИстории_Открыть_");
	
	ИменаКоманд.Добавить("ЛичнаяЗадачаПланов_Открыть_");
	ИменаКоманд.Добавить("ЛичнаяЗадачаПланов_Удалить_");
	ИменаКоманд.Добавить("ЛичнаяЗадачаИстории_Открыть_");
	
	ИменаКоманд.Добавить("Примечание_Открыть_");
	ИменаКоманд.Добавить("Примечание_Удалить_");
	
	ИменаКоманд.Добавить("Счет_СоздатьНаОсновании_");
	ИменаКоманд.Добавить("Заказ_СоздатьНаОсновании_");
	
	ИменаКоманд.Добавить("Файл_Открыть_");
	ИменаКоманд.Добавить("Файл_Перейти_");
	ИменаКоманд.Добавить("Файлы_Показать_");
	
	Возврат ИменаКоманд;
	
КонецФункции

Процедура ВыполнитьКомандуЛенты(ИмяКоманды, ПараметрКоманды, Форма) Экспорт
	
	Если ИмяКоманды = "ВзаимодействиеПланов_Открыть_" Тогда
		
		ОбъектСсылка = CRM_ЛентаСобытий.СсылкаПоИдентификатору(ПараметрКоманды);
		ИмяФормы = "Документ.CRM_Взаимодействие.Форма.ФормаДокументаКраткая";
		ПараметрыФормы = Новый Структура("Ключ", ОбъектСсылка);
		РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
		ДокОснование = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "ДокументОснование");
		Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.CRM_Интерес") И ДокОснование <> Форма.Объект.Ссылка Тогда
			ИмяФормы = "Документ.CRM_Интерес.Форма.ФормаДокументаНовая";
			ПараметрыФормы = Новый Структура("Ключ, ПозиционироватьНаВзаимодействие", ДокОснование, ОбъектСсылка);
			РежимОткрытия = РежимОткрытияОкнаФормы.Независимый;
		КонецЕсли;
		
		ОткрытьФорму(ИмяФормы,
			ПараметрыФормы,
			Форма,
			Форма.УникальныйИдентификатор,,,,
			РежимОткрытия);
			
	ИначеЕсли ИмяКоманды = "ВзаимодействиеИстории_Открыть_" Тогда
		
		ОбъектСсылка = CRM_ЛентаСобытий.СсылкаПоИдентификатору(ПараметрКоманды);
		ОткрытьФорму("Документ.CRM_Взаимодействие.Форма.ФормаДокумента",
			Новый Структура("Ключ, ОткрыватьФорму", ОбъектСсылка, Истина),
			Форма,
			Форма.УникальныйИдентификатор,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ИмяКоманды = "ЛичнаяЗадачаПланов_Открыть_" Тогда
		
		ОбъектСсылка = CRM_ЛентаСобытий.СсылкаПоИдентификатору(ПараметрКоманды);
		ИмяФормы = "Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачиКраткая";
		ПараметрыФормы = Новый Структура("Ключ", ОбъектСсылка);
		РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
		ДокОснование = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "Предмет");
		Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.CRM_Интерес") И ДокОснование <> Форма.Объект.Ссылка Тогда
			ИмяФормы = "Документ.CRM_Интерес.Форма.ФормаДокументаНовая";
			ПараметрыФормы = Новый Структура("Ключ, ПозиционироватьНаВзаимодействие", ДокОснование, ОбъектСсылка);
			РежимОткрытия = РежимОткрытияОкнаФормы.Независимый;
		КонецЕсли;
		
		ОткрытьФорму(ИмяФормы,
			ПараметрыФормы,
			Форма,
			Форма.УникальныйИдентификатор,,,,
			РежимОткрытия);
		
	ИначеЕсли ИмяКоманды = "ЛичнаяЗадачаИстории_Открыть_" Тогда
		
		ОбъектСсылка = CRM_ЛентаСобытий.СсылкаПоИдентификатору(ПараметрКоманды);
		ОткрытьФорму("Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачи",
			Новый Структура("Ключ", ОбъектСсылка),
			Форма,
			Форма.УникальныйИдентификатор,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ИмяКоманды = "Примечание_Открыть_" Тогда
		
		ОбъектСсылка = CRM_ЛентаСобытий.СсылкаПоИдентификатору(ПараметрКоманды);
		ОткрытьФорму("Справочник.Заметки.Форма.CRM_ФормаЭлемента",
			Новый Структура("Ключ", ОбъектСсылка),
			Форма,
			Форма.УникальныйИдентификатор,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ИмяКоманды = "ВзаимодействиеПланов_Отменить" Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Команда",			"Отменить");
		ДополнительныеПараметры.Вставить("ПараметрКоманды",	ПараметрКоманды);
		
		ТекстВопроса = НСтр("ru='Взаимодействие будет отменено. Продолжить?';en='Interaction will be cancelled. Continue?'");
		ОповещениеЗавершения = Новый ОписаниеОповещения("ВыполнитьКомандуЛентыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОповещениеЗавершения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли ИмяКоманды = "ЛичнаяЗадачаПланов_Удалить_" Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Команда",			"Удалить");
		ДополнительныеПараметры.Вставить("ПараметрКоманды",	ПараметрКоманды);
		
		ТекстВопроса = НСтр("ru='Задача будет удалена. Продолжить?';en='Task will be deleted. Continue?'");
		ОповещениеЗавершения = Новый ОписаниеОповещения("ВыполнитьКомандуЛентыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОповещениеЗавершения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли ИмяКоманды = "Примечание_Удалить_" Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Команда",			"Удалить");
		ДополнительныеПараметры.Вставить("ПараметрКоманды",	ПараметрКоманды);
		
		ТекстВопроса = НСтр("ru='Примечание будет удалено. Продолжить?';en='Note will be deleted. Continue?'");
		ОповещениеЗавершения = Новый ОписаниеОповещения("ВыполнитьКомандуЛентыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОповещениеЗавершения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли ИмяКоманды = "Счет_СоздатьНаОсновании_" Тогда
		
		ОбъектСсылка = CRM_ЛентаСобытий.СсылкаПоИдентификатору(ПараметрКоманды);
		ИмяФормы = "Документ.CRM_СчетНаОплатуПокупателю.ФормаОбъекта";
		ОткрытьФорму(ИмяФормы, Новый Структура("Основание", ОбъектСсылка), Форма, Форма.УникальныйИдентификатор);
		
	ИначеЕсли ИмяКоманды = "Заказ_СоздатьНаОсновании_" Тогда
		
		ОбъектСсылка = CRM_ЛентаСобытий.СсылкаПоИдентификатору(ПараметрКоманды);
		ИмяФормы = "Документ.ЗаказКлиента.ФормаОбъекта";
		ОткрытьФорму(ИмяФормы, Новый Структура("Основание", ОбъектСсылка), Форма, Форма.УникальныйИдентификатор);
		
	ИначеЕсли ИмяКоманды = "Файл_Открыть_" Тогда
		
		ДанныеФайла = CRM_ЛентаСобытий.ДанныеФайлаПоИдентификатору(ПараметрКоманды, Форма.УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
		
	ИначеЕсли ИмяКоманды = "Файл_Перейти_" Тогда
		
		ОбъектСсылка = CRM_ЛентаСобытий.СсылкаПоИдентификатору(ПараметрКоманды);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТолькоПросмотр",	Форма.ТолькоПросмотр);
		ПараметрыФормы.Вставить("СкрыватьВладельца",Истина);
		ПараметрыФормы.Вставить("ТекущаяСтрока",	ОбъектСсылка);
		
		ФормаФайлы = ПолучитьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, Форма, Форма.УникальныйИдентификатор);
		ФормаФайлы.Открыть();
		
		ФормаФайлы.Элементы.Список.ТекущаяСтрока = ОбъектСсылка;
		
	ИначеЕсли ИмяКоманды = "Файлы_Показать_" Тогда
		
		ОбъектСсылка = CRM_ЛентаСобытий.СсылкаПоИдентификатору(ПараметрКоманды);
		
		Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
			Или ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
			ПоказатьЗначение(, ОбъектСсылка);
		Иначе
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ТолькоПросмотр",	Форма.ТолькоПросмотр);
			ПараметрыФормы.Вставить("СкрыватьВладельца",Истина);
			ПараметрыФормы.Вставить("ВладелецФайла",	ОбъектСсылка);
			ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, Форма, Форма.УникальныйИдентификатор);
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКомандуЛентыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	CRM_ЛентаСобытий.ВыполнитьКомандуЛентыНаСервере(
		ДополнительныеПараметры.Команда, ДополнительныеПараметры.ПараметрКоманды);
	Оповестить("ЛентаСобытий_Обновить");
	
КонецПроцедуры

Функция ПроверитьЗаполнениеБыстрогоВвода(Знач ТипОбъекта, Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	ПроверяемыеРеквизиты = Новый Соответствие;
	
	Если ТипОбъекта = "Примечание" Тогда
		
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_Тема",				Элементы.БыстрыйВвод_ПримечаниеТема.Имя);
		
	ИначеЕсли ТипОбъекта = "Взаимодействие" Тогда
		
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_ВзаимодействиеОтправитель",	Элементы.БыстрыйВвод_ВзаимодействиеОтправитель.Имя);
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_ВзаимодействиеВид",			Элементы.БыстрыйВвод_ВзаимодействиеВид.Имя);
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_Тема",						Элементы.БыстрыйВвод_ВзаимодействиеТема.Имя);
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_ДатаНачала",					Элементы.БыстрыйВвод_ВзаимодействиеДатаНачала_Дата.Имя);
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_ДатаОкончания",				Элементы.БыстрыйВвод_ВзаимодействиеДатаОкончания_Дата.Имя);
		
	ИначеЕсли ТипОбъекта = "Задача" Тогда
		
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_ЗадачаПолучатель",	Элементы.БыстрыйВвод_ЗадачаПолучатель.Имя);
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_ДатаОкончания",		Элементы.БыстрыйВвод_ЗадачаДатаОкончания_Дата.Имя);
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_Тема",				Элементы.БыстрыйВвод_ЗадачаТема.Имя);
		
	ИначеЕсли ТипОбъекта = "Письмо" Тогда
		
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_ПисьмоСписокПолучателейПисьма",	Элементы.БыстрыйВвод_ПисьмоСписокПолучателейПисьма.Имя);
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_Тема",							Элементы.БыстрыйВвод_ПисьмоТема.Имя);
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_Содержание",						Элементы.БыстрыйВвод_ПисьмоСодержание.Имя);
		
	ИначеЕсли ТипОбъекта = "Чат" Тогда
		
		ПроверяемыеРеквизиты.Вставить("БыстрыйВвод_Содержание",			Элементы.БыстрыйВвод_ЧатСодержание.Имя);
		
	КонецЕсли;
	
	Успех = Истина;
	Для Каждого ОписаниеРеквизита Из ПроверяемыеРеквизиты Цикл
		
		ИмяРеквизита = ОписаниеРеквизита.Ключ;
		ИмяЭлемента = ОписаниеРеквизита.Значение;
		
		Если Не ЗначениеЗаполнено(Форма[ИмяРеквизита]) Тогда
			Успех = Ложь;
			ТекстСообщения = СтрШаблон(НСтр("ru='Поле ""%1"" не заполнено ';en='Field ""%1"" is not filled '"), Элементы[ИмяЭлемента].Заголовок);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ИмяРеквизита);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Успех;
	
КонецФункции

Процедура ПоказатьПолнуюФормуОбъекта(Знач Режим, Знач ТипОбъекта, Форма) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	
	ДанныеЗаполнения = ДанныеЗаполненияОбъектаБыстрогоВвода(Режим, ТипОбъекта, Форма);
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
	
	Если ТипОбъекта = "Взаимодействие" Тогда
		ПараметрыОткрытия.Вставить("ОткрыватьФорму", Истина);
		ИмяФормы = "Документ.CRM_Взаимодействие.Форма.ФормаДокумента";
	ИначеЕсли ТипОбъекта = "Задача" Тогда
		ПараметрыОткрытия.Вставить("ИзСпискаАктивностей", Ложь);
		ИмяФормы = "Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачи";
	ИначеЕсли ТипОбъекта = "Письмо" Тогда
		ИмяФормы = "Документ.ЭлектронноеПисьмоИсходящее.Форма.CRM_ФормаДокумента";
	ИначеЕсли ТипОбъекта = "Заметки" Тогда
		ИмяФормы = "Справочник.Заметки.Форма.CRM_ФормаЭлемента";
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормы, ПараметрыОткрытия,
		Форма,
		Форма.УникальныйИдентификатор,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

Процедура НастроитьОбластьВводаПослеФормированияЛенты(Знач ПолучателиЧата, Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	ВидимостьКомандыЧат = Форма.Лента_ЗначенияНастроек.ИспользоватьЧаты И (ПолучателиЧата.Количество() > 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_Чат", "Видимость", ВидимостьКомандыЧат);
	
	Если ВидимостьКомандыЧат Тогда
		
		Форма.БыстрыйВвод_ЧатПолучатели.Очистить();
		ЧатПолучателиСписокВыбора = Элементы.БыстрыйВвод_ЧатПредставлениеПолучателя.СписокВыбора;
		ЧатПолучателиСписокВыбора.Очистить();
		
		Для Каждого ДанныеПолучателя Из ПолучателиЧата Цикл
			НоваяСтрока = Форма.БыстрыйВвод_ЧатПолучатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеПолучателя);
			ЧатПолучателиСписокВыбора.Добавить(ДанныеПолучателя.Идентификатор, ДанныеПолучателя.Представление);
		КонецЦикла;
		
		ПервыйПолучатель = Форма.БыстрыйВвод_ЧатПолучатели[0];
		Форма.БыстрыйВвод_ЧатИдентификаторПолучателя	= ПервыйПолучатель.Идентификатор;
		Форма.БыстрыйВвод_ЧатАдрес						= ПервыйПолучатель.Адрес;
		Форма.БыстрыйВвод_ЧатПолучатель					= ПервыйПолучатель.Контакт;
		Форма.БыстрыйВвод_ЧатПредставлениеПолучателя	= ПервыйПолучатель.Представление;
		Форма.БыстрыйВвод_ЧатУчетнаяЗапись				= ПервыйПолучатель.УчетнаяЗапись;
		Форма.БыстрыйВвод_ЧатГруппа						= ПервыйПолучатель.Группа;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеЗаполненияОбъектаБыстрогоВвода(Знач Режим, Знач ТипОбъекта, Форма) Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	
	Если ТипОбъекта = "Примечание" Тогда
		
		ДанныеЗаполнения.Вставить("ДатаИзменения",			ТекущаяДата());
		ДанныеЗаполнения.Вставить("Предмет",				Форма.Объект.Ссылка);
		ДанныеЗаполнения.Вставить("Автор",					Форма.ТекущийПользователь);
		ДанныеЗаполнения.Вставить("ТекстСодержания",		Форма.БыстрыйВвод_Тема);
		ДанныеЗаполнения.Вставить("CRM_ЗаметкаЛенты",		Истина);
		
	ИначеЕсли ТипОбъекта = "Взаимодействие" Тогда
		
		ДанныеЗаполнения.Вставить("Дата",					ТекущаяДата());
		ДанныеЗаполнения.Вставить("ВидВзаимодействия",		Форма.БыстрыйВвод_ВзаимодействиеВид);
		Если Режим = "ЛентаИнтереса" Тогда
			ДанныеЗаполнения.Вставить("ДокументОснование",	Форма.Объект.Ссылка);
			ДанныеЗаполнения.Вставить("Партнер",			Форма.БыстрыйВвод_ВзаимодействиеПартнер);
			ДанныеЗаполнения.Вставить("СостояниеИнтереса",	Форма.Объект.СостояниеИнтереса);
		ИначеЕсли Режим = "ЛентаКлиента" Тогда
			ДанныеЗаполнения.Вставить("Партнер",			Форма.Объект.Ссылка);
		ИначеЕсли Режим = "ЛентаКонтакта" Тогда
			ДанныеЗаполнения.Вставить("Партнер",			Форма.Объект.Владелец);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("КонтактноеЛицо",			Форма.БыстрыйВвод_ВзаимодействиеПолучатель);
		ДанныеЗаполнения.Вставить("ПлановаяДата",			Форма.БыстрыйВвод_ДатаНачала);
		ДанныеЗаполнения.Вставить("ПлановаяДатаЗавершение",	Форма.БыстрыйВвод_ДатаОкончания);
		ДанныеЗаполнения.Вставить("НаВесьДень",				Форма.БыстрыйВвод_ВзаимодействиеНаВесьДень);
		ДанныеЗаполнения.Вставить("Тема",					Форма.БыстрыйВвод_Тема);
		ДанныеЗаполнения.Вставить("Содержание",				Форма.БыстрыйВвод_Содержание);
		ДанныеЗаполнения.Вставить("Ответственный",			Форма.БыстрыйВвод_ВзаимодействиеОтправитель);
		
	ИначеЕсли ТипОбъекта = "Задача" Тогда
		
		ДанныеЗаполнения.Вставить("Дата",						ТекущаяДата());
		ДанныеЗаполнения.Вставить("Автор",						Форма.ТекущийПользователь);
		ДанныеЗаполнения.Вставить("Исполнитель",				Форма.БыстрыйВвод_ЗадачаПолучатель);
		ДанныеЗаполнения.Вставить("Предмет",					Форма.Объект.Ссылка);
		ДанныеЗаполнения.Вставить("ПредметСтрокой",				CRM_БизнесПроцессыИЗадачиСервер.ПредметСтрокой(Форма.Объект.Ссылка));
		ДанныеЗаполнения.Вставить("ДатаНачала",					Форма.БыстрыйВвод_ДатаНачала);
		ДанныеЗаполнения.Вставить("СрокИсполнения",				Форма.БыстрыйВвод_ДатаОкончания);
		ДанныеЗаполнения.Вставить("Наименование",				Форма.БыстрыйВвод_Тема);
		ДанныеЗаполнения.Вставить("Описание",					Форма.БыстрыйВвод_Содержание);
		ДанныеЗаполнения.Вставить("Важность",					ПредопределенноеЗначение("Перечисление.ВариантыВажностиЗадачи.Обычная"));
		Если Режим = "ЛентаИнтереса" Тогда
			ДанныеЗаполнения.Вставить("CRM_Партнер",			Форма.Объект.Партнер);
			ДанныеЗаполнения.Вставить("CRM_КонтактноеЛицо",		Форма.Объект.КонтактноеЛицо);
			ДанныеЗаполнения.Вставить("CRM_Проект",				Форма.Объект.Проект);
		ИначеЕсли Режим = "ЛентаКлиента" Тогда
			ДанныеЗаполнения.Вставить("CRM_Партнер",			Форма.Объект.Ссылка);
		Иначе
			ДанныеЗаполнения.Вставить("CRM_Партнер",			Форма.Объект.Владелец);
			ДанныеЗаполнения.Вставить("CRM_КонтактноеЛицо",		Форма.Объект.Ссылка);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("СостояниеБизнесПроцесса",	ПредопределенноеЗначение("Перечисление.СостоянияБизнесПроцессов.Активен"));
		ДанныеЗаполнения.Вставить("ПринятаКИсполнению",			Истина);
		ДанныеЗаполнения.Вставить("CRM_Личная",					Истина);
		
	ИначеЕсли ТипОбъекта = "Письмо" Тогда
		
		ДанныеЗаполнения.Вставить("ДанныеБыстрогоВвода", 			Истина);
		Если Режим = "ЛентаИнтереса" Тогда
			ДанныеЗаполнения.Вставить("ДокументОснование",			Форма.Объект.Ссылка);
			Если Форма.Объект.Свойство("Проект") Тогда
				ДанныеЗаполнения.Вставить("CRM_Проект",					Форма.Объект.Проект);
			КонецЕсли;
			Если Форма.Объект.Свойство("СостояниеИнтереса") Тогда
				ДанныеЗаполнения.Вставить("СостояниеИнтереса",			Форма.Объект.СостояниеИнтереса);
			КонецЕсли;
		Иначе
			ДанныеЗаполнения.Вставить("ДокументОснование",			Неопределено);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("Дата",							ТекущаяДата());
		ДанныеЗаполнения.Вставить("Шаблон",							Форма.Шаблон);
		ДанныеЗаполнения.Вставить("Автор",							Форма.ТекущийПользователь);
		ДанныеЗаполнения.Вставить("Ответственный",					Форма.ТекущийПользователь);
		ДанныеЗаполнения.Вставить("СписокПолучателейПисьма",		Форма.БыстрыйВвод_ПисьмоСписокПолучателейПисьма);
		ДанныеЗаполнения.Вставить("СписокПолучателейКопий",			Форма.БыстрыйВвод_ПисьмоСписокПолучателейКопий);
		ДанныеЗаполнения.Вставить("СписокПолучателейСкрытыхКопий",	Форма.БыстрыйВвод_ПисьмоСписокПолучателейСкрытыхКопий);
		ДанныеЗаполнения.Вставить("Тема",							Форма.БыстрыйВвод_Тема);
		ДанныеЗаполнения.Вставить("ОтправлятьСразу",				Форма.БыстрыйВвод_ПисьмоОтправлятьСразу);
		ДанныеЗаполнения.Вставить("УникальныйИдентификатор",		Форма.УникальныйИдентификатор);
		
		ТекстыПисьма = CRM_ЛентаСобытий.ТекстыПисьма(Форма.БыстрыйВвод_Содержание,
			Форма.БыстрыйВвод_ПисьмоУчетнаяЗапись, Форма.ТекущийПользователь);
		
		ДанныеЗаполнения.Вставить("Текст",							ТекстыПисьма.ТекстПисьма);
		ДанныеЗаполнения.Вставить("ТекстHTML",						ТекстыПисьма.ТекстHTML);
		
		ДанныеЗаполнения.Вставить("ТипТекста",						ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.HTML"));
		ДанныеЗаполнения.Вставить("УчетнаяЗапись",					Форма.БыстрыйВвод_ПисьмоУчетнаяЗапись);
		ДанныеЗаполнения.Вставить("ОтправительПредставление",		Форма.БыстрыйВвод_ПисьмоОтправительПредставление);
		
		ПолучателиМассив = Новый Массив;
		Для Каждого СтрокаПолучателя Из Форма.БыстрыйВвод_ПисьмоПолучатели Цикл
			НовыйЭлемент = Новый Структура("Адрес,Представление,Контакт");
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтрокаПолучателя);
			ПолучателиМассив.Добавить(НовыйЭлемент);
		КонецЦикла;
		ДанныеЗаполнения.Вставить("ПолучателиПисьма",				ПолучателиМассив);
		
		ПолучателиМассив = Новый Массив;
		Для Каждого СтрокаПолучателя Из Форма.БыстрыйВвод_ПисьмоПолучателиКопий Цикл
			НовыйЭлемент = Новый Структура("Адрес,Представление,Контакт");
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтрокаПолучателя);
			ПолучателиМассив.Добавить(НовыйЭлемент);
		КонецЦикла;
		ДанныеЗаполнения.Вставить("ПолучателиКопий",				ПолучателиМассив);
		
		ПолучателиМассив = Новый Массив;
		Для Каждого СтрокаПолучателя Из Форма.БыстрыйВвод_ПисьмоПолучателиСкрытыхКопий Цикл
			НовыйЭлемент = Новый Структура("Адрес,Представление,Контакт");
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтрокаПолучателя);
			ПолучателиМассив.Добавить(НовыйЭлемент);
		КонецЦикла;
		ДанныеЗаполнения.Вставить("ПолучателиСкрытыхКопий",			ПолучателиМассив);
		
	ИначеЕсли ТипОбъекта = "Чат" Тогда
		
		ДанныеЗаполнения.Вставить("Содержание",						Форма.БыстрыйВвод_Содержание);
		ДанныеЗаполнения.Вставить("УчетнаяЗапись",					Форма.БыстрыйВвод_ЧатУчетнаяЗапись);
		ДанныеЗаполнения.Вставить("Группа",							Форма.БыстрыйВвод_ЧатГруппа);
		ДанныеЗаполнения.Вставить("Адрес",							Форма.БыстрыйВвод_ЧатАдрес);
		ДанныеЗаполнения.Вставить("Получатель",						Форма.БыстрыйВвод_ЧатПолучатель);
		ДанныеЗаполнения.Вставить("ПредставлениеПолучателя",		Форма.БыстрыйВвод_ЧатПредставлениеПолучателя);
		// +Рарус alexpr
		ДанныеЗаполнения.Вставить("ЭтоНомерТелефона", Форма.БыстрыйВвод_ЧатЭтоНомерТелефона);
		// -Рарус alexpr
		Если Режим = "ЛентаИнтереса" Тогда
			ДанныеЗаполнения.Вставить("ДокументОснование",			Форма.Объект.Ссылка);
			ДанныеЗаполнения.Вставить("СостояниеИнтереса",			Форма.Объект.СостояниеИнтереса);
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = "Файл" Тогда
		
		ДанныеВложений = Новый Массив;
		Для Каждого СтрокаВложения Из Форма.БыстрыйВвод_Вложения Цикл
			
			ПараметрыФайла = РаботаСФайламиСлужебныйКлиентСервер.ПараметрыДобавленияФайла();
			ПараметрыФайла.Автор = Форма.ТекущийПользователь;
			ПараметрыФайла.ВладелецФайлов = Форма.Объект.Ссылка;
			ПараметрыФайла.ИмяБезРасширения = СтрокаВложения.ИмяФайла;
			
			АдресФайлаВоВременномХранилище = "";
			
			ДанныеФайла = Новый Структура;
			ДанныеФайла.Вставить("ПараметрыФайла", ПараметрыФайла);
			ДанныеФайла.Вставить("АдресФайлаВоВременномХранилище", СтрокаВложения.АдресВХранилище);
			ДанныеФайла.Вставить("Описание", Форма.БыстрыйВвод_Тема);
			
			ДанныеВложений.Добавить(ДанныеФайла);
			
		КонецЦикла;
		
		ДанныеЗаполнения.Вставить("ДанныеВложений", ДанныеВложений);
		
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Процедура СоздатьОбъектОбычныйВвод(Знач Режим, Знач ТипОбъекта, Форма) Экспорт
	
	Если ТипОбъекта = "Интерес" Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Основание", Форма.Объект.Ссылка);
		ОткрытьФорму("Документ.CRM_Интерес.ФормаОбъекта", ПараметрыОткрытия, Форма, Форма.УникальныйИдентификатор);
		
	ИначеЕсли ТипОбъекта = "Счет" Тогда
		
		ИмяФормы = "Документ.CRM_СчетНаОплатуПокупателю.ФормаОбъекта";
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Основание", Форма.Объект.Ссылка);
		ОткрытьФорму(ИмяФормы, ПараметрыОткрытия, Форма, Форма.УникальныйИдентификатор);
		
	ИначеЕсли ТипОбъекта = "ЗаказКлиента" Тогда
		
		ИмяФормы = "Документ.ЗаказКлиента.ФормаОбъекта";
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Основание", Форма.Объект.Ссылка);
		ОткрытьФорму(ИмяФормы, ПараметрыОткрытия, Форма, Форма.УникальныйИдентификатор);
		
	ИначеЕсли ТипОбъекта = "КоммерческоеПредложение" Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Основание", Форма.Объект.Ссылка);
		ОткрытьФорму("Документ.КоммерческоеПредложениеКлиенту.ФормаОбъекта", ПараметрыОткрытия, Форма, Форма.УникальныйИдентификатор);
		
	ИначеЕсли ТипОбъекта = "Поручение" Тогда
		
		ПараметрыОснования = Новый Структура;
		Если Режим = "ЛентаКонтакта" Тогда
			ПараметрыОснования.Вставить("Основание", Форма.Объект.Владелец);
			ПараметрыОснования.Вставить("КонтактноеЛицо", Форма.Объект.Ссылка);
		Иначе
			ПараметрыОснования.Вставить("Основание", Форма.Объект.Ссылка);
		КонецЕсли;
		ПараметрыОснования.Вставить("КартаМаршрута", ПредопределенноеЗначение("Справочник.CRM_КартыМаршрутов.Поручение"));
		
		ПараметрыОткрытия = Новый Структура("Основание", ПараметрыОснования);
		
		ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаПоручения", ПараметрыОткрытия, Форма, Форма.УникальныйИдентификатор);
		
	ИначеЕсли ТипОбъекта = "БизнесПроцесс" Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ПредметОснование", Форма.Объект.Ссылка);
		ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаВыборИзДерева", ПараметрыОткрытия, Форма, Форма.УникальныйИдентификатор);
		
	ИначеЕсли ТипОбъекта = "СообщениеSMS" Тогда
		
		Если Режим = "ЛентаИнтереса" Тогда
			ПотенциальныйКлиент	= Форма.Объект.ПотенциальныйКлиент;
			КонтактноеЛицо		= Форма.Объект.КонтактноеЛицо;
			Партнер				= Форма.Объект.Партнер;
		ИначеЕсли Режим = "ЛентаКлиента" Тогда
			ПотенциальныйКлиент	= Неопределено;
			КонтактноеЛицо		= Форма.Объект.CRM_ОсновноеКонтактноеЛицо;
			Партнер				= Форма.Объект.Ссылка;
		Иначе
			ПотенциальныйКлиент	= Неопределено;
			КонтактноеЛицо		= Форма.Объект.Ссылка;
			Партнер				= Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПотенциальныйКлиент) Тогда
			Контакт = ПотенциальныйКлиент;
		Иначе
			Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
				Контакт = КонтактноеЛицо;
			Иначе
				Контакт = Партнер;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Контакт) Тогда
			Возврат;
		КонецЕсли;
		
		ТелефонКонтакта = "";
		СписокТелефонов = SMS4B_Взаимодействия.SMS4B_ТелефоныКонтакта(Контакт);
		Если СписокТелефонов.Количество() > 0 Тогда
			ТелефонКонтакта = СписокТелефонов[0].Значение;
		КонецЕсли;
		
		ПараметрыОснования = Новый Структура;
		ПараметрыОснования.Вставить("Ссылка",	Контакт);
		Если Режим = "ЛентаИнтереса" Тогда
			ПараметрыОснования.Вставить("ВзаимодействиеОснование", Форма.Объект.Ссылка);
		КонецЕсли;
		ПараметрыОснования.Вставить("Телефон",	ТелефонКонтакта);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Основание", ПараметрыОснования);
		ПараметрыОткрытия.Вставить("СокращеннаяФорма", Истина);
		ПараметрыОткрытия.Вставить("ДанныеЗаполнения", Форма.Объект.Ссылка);
		
		ОткрытьФорму("Документ.СообщениеSMS.ФормаОбъекта", ПараметрыОткрытия, Форма, Форма.УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьВопросОЗаписиОбъекта(Форма, ОповещениеЗавершения, ПроверятьМодифицированность) Экспорт
	
	Если Форма.Объект.Ссылка.Пустая() Или (ПроверятьМодифицированность И Форма.Модифицированность) Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
		
		ОповещениеПродолжения = Новый ОписаниеОповещения("ОбработатьОтветНаВопросОЗаписиОбъекта", CRM_ЛентаСобытийКлиент, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru='Данные будут записаны. Продолжить?';en='Data will be written. Continue?'");
		ПоказатьВопрос(ОповещениеПродолжения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьОтветНаВопросОЗаписиОбъекта(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	ОповещениеЗавершения = ДополнительныеПараметры.ОповещениеЗавершения;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		CRM_ОбщегоНазначенияКлиент.Записать(Форма, Истина, ОповещениеЗавершения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
